html/111/zzzz-jinengkaoshi.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-04-28 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>职业技能考试</title>
<meta name="generator" content="Org mode">
<meta name="author" content="悟饭">
<link rel='stylesheet' href='/html/asset/common.css?3344' />
<link rel='stylesheet' href='/yaoliuyao/html/asset/common.css?3344' />

</head>
<body>
<div id="content">
<header>
<h1 class="title">职业技能考试</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfb5496d">1. 基本要求</a></li>
<li><a href="#org401bbf9">2. 你能用到的</a></li>
<li><a href="#orgedd110c">3. 基本答题步骤</a></li>
</ul>
</div>
</nav>


<section id="outline-container-orgfb5496d" class="outline-2">
<h2 id="orgfb5496d"><span class="section-number-2">1.</span> 基本要求</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>使用 VS2022 + SqlServer2015 进行开发 (sqlserver: sa/123456)</li>
<li>务必按照题目要求做事，不要做多余的，也不要忽略题目要求</li>
<li>使用自己最擅长的技术，最好最快的就是 .NET MVC，用 Razor 写界面</li>
</ul>
</div>
</section>

<section id="outline-container-org401bbf9" class="outline-2">
<h2 id="org401bbf9"><span class="section-number-2">2.</span> 你能用到的</h2>
<div class="outline-text-2" id="text-2">
<p>
在考试机器的桌面上，你会发现你用到的三个快捷方式:
</p>
<ul class="org-ul">
<li>drawio (用来绘图，请提前了解)</li>
<li>Visual Studio 2022 (你的 IDE，不要擅作主张去用 VSCode)</li>
<li>SSMS (SqlServer 客户端工具)</li>
</ul>

<p>
在考试的文件夹中，你能发现试题以及截图文件:
</p>
<ul class="org-ul">
<li>截图.exe</li>
</ul>

<p>
在 C 盘，你能发现一些参考资料 (请谨慎使用，低调使用):
</p>
<ul class="org-ul">
<li>C:\Logs\BZ</li>
</ul>
</div>
</section>


<section id="outline-container-orgedd110c" class="outline-2">
<h2 id="orgedd110c"><span class="section-number-2">3.</span> 基本答题步骤</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>首先, <b>仔细</b> 阅读题目</li>
<li>然后，打开 VS2022</li>
<li>随后，创建一个 MVC Core 项目:
<ul class="org-ul">
<li>项目命名要按照要求来</li>
<li><b>务必选择 .NET 版本为 5.0</b></li>
<li>务必记住项目的存储路径</li>
</ul></li>
<li>用记事本打开 <code>C:\Logs\BZ\RecruitProject22\RecruitProject22.csproj</code> 文件，将添加依赖的一段拷贝到我们新项目的 .csproj 文件内。</li>
<li><p>
拷贝完成，你项目的 .csproj 大致是这样的 (拷贝完成最好调用 dotnet restore 还原一下):
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #0000ff;">Project</span> <span style="color: #a0522d;">Sdk</span>=<span style="color: #8b2252;">"Microsoft.NET.Sdk.Web"</span>&gt;
    &lt;<span style="color: #0000ff;">PropertyGroup</span>&gt;
        &lt;<span style="color: #0000ff;">TargetFramework</span>&gt;net5.0&lt;/<span style="color: #0000ff;">TargetFramework</span>&gt;
    &lt;/<span style="color: #0000ff;">PropertyGroup</span>&gt;
    <span style="color: #b22222;">&lt;!-- </span><span style="color: #b22222;">&#21153;&#24517;&#30830;&#23450;&#20381;&#36182;&#29256;&#26412;&#26159; 5.* </span><span style="color: #b22222;">--&gt;</span>
    &lt;<span style="color: #0000ff;">ItemGroup</span>&gt;
        &lt;<span style="color: #0000ff;">PackageReference</span> <span style="color: #a0522d;">Include</span>=<span style="color: #8b2252;">"Microsoft.EntityFrameworkCore.Design"</span> <span style="color: #a0522d;">Version</span>=<span style="color: #8b2252;">"5.0.0"</span>&gt;
            &lt;<span style="color: #0000ff;">IncludeAssets</span>&gt;runtime; build; native; contentfiles; analyzers; buildtransitive&lt;/<span style="color: #0000ff;">IncludeAssets</span>&gt;
            &lt;<span style="color: #0000ff;">PrivateAssets</span>&gt;all&lt;/<span style="color: #0000ff;">PrivateAssets</span>&gt;
        &lt;/<span style="color: #0000ff;">PackageReference</span>&gt;
        &lt;<span style="color: #0000ff;">PackageReference</span> <span style="color: #a0522d;">Include</span>=<span style="color: #8b2252;">"Microsoft.EntityFrameworkCore.SQLite"</span> <span style="color: #a0522d;">Version</span>=<span style="color: #8b2252;">"5.0.0"</span> /&gt;
        &lt;<span style="color: #0000ff;">PackageReference</span> <span style="color: #a0522d;">Include</span>=<span style="color: #8b2252;">"Microsoft.EntityFrameworkCore.SqlServer"</span> <span style="color: #a0522d;">Version</span>=<span style="color: #8b2252;">"5.0.0"</span> /&gt;
        &lt;<span style="color: #0000ff;">PackageReference</span> <span style="color: #a0522d;">Include</span>=<span style="color: #8b2252;">"Microsoft.VisualStudio.Web.CodeGeneration.Design"</span> <span style="color: #a0522d;">Version</span>=<span style="color: #8b2252;">"5.0.0"</span> /&gt;
    &lt;/<span style="color: #0000ff;">ItemGroup</span>&gt;
&lt;/<span style="color: #0000ff;">Project</span>&gt;
</pre>
</div></li>
<li>打开桌面的 <code>drawio</code> 工具，按要求绘制相关 UML 图，然后使用 <code>截图.exe</code> 截图保存到相应位置</li>
<li>在项目中完成功能实现。文件夹 <code>C:\Logs\BZ</code> 下的内容 <b>仅供参考，谢绝照搬</b> !</li>
<li>按照要求，打包文件。</li>
<li>最后，最重要的:
<ul class="org-ul">
<li><b>仔细检查项目，务必按照要求，提交考试文件！</b></li>
<li>注意命名格式，不要少提交东西，切切!</li>
</ul></li>
</ul>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 悟饭</p>
<p class="date">Created: 2022-04-28</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
